
import java.util.Random;

//T2. Добавить класс билдера, в нем склеивать запрос, и составлять запрос на CRuD
public class Generator {
    private final String[] maleNamesRus = new String[]{"Аарон", "Аба", "Аббас", "Абд аль-Узза", "Абдуллах", "Абид", "Аботур", "Аввакум", "Август", "Авдей", "Авель", "Аверкий", "Авигдор", "Авирмэд", "Авксентий", "Авл", "Авнер", "Аврелий", "Автандил", "Автоном", "Агапит", "Агафангел", "Агафодор", "Аквилий", "Акиф", "Акоп", "Аксель", "Алан", "Аланус", "Алек", "Александр", "Алексей", "Алем", "Анатолий", "Ангеляр", "Андокид", "Андрей", "Андроник", "Аннерс", "Анри", "Ансельм", "Антипа", "Антон", "Антоний", "Антонин", "Антуан", "Арам", "Арефа", "Арзуман", "Аристарх", "Аристон", "Ариф", "Аркадий", "Арсений", "Артём", "Артур", "Арфаксад", "Асаф", "Атанасий", "Атом", "Аттик", "Афанасий", "Афинагор", "Афиней", "Афиф", "Африкан", "Ахилл", "Ахмад", "Ахтям", "Ашот", "Бадар", "Барни", "Бартоломео", "Басир", "Бахтияр", "Баян", "Безсон", "Бен", "Беньямин", "Берт", "Бехруз", "Билял", "Богдан", "Болеслав", "Бонавентура", "Борис", "Борислав", "Боян", "Бронислав", "Брячислав", "Вадим", "Валентин", "Валентино", "Валерий", "Валерьян", "Вальдемар", "Варфоломей", "Василий", "Вениамин", "Венцеслав", "Вигго", "Викентий", "Виктор", "Викторин", "Вильгельм", "Винцас", "Виссарион", "Виталий", "Витаутас", "Вито", "Владимир", "Владислав", "Владлен", "Влас", "Воислав", "Володарь", "Вольфганг", "Вописк", "Всеволод", "Всеслав", "Вук", "Вукол", "Вышеслав", "Вячеслав", "Габриеле", "Гавриил", "Гай", "Галактион", "Галымжан", "Гамлет", "Гаспар", "Гафур", "Гвидо", "Гейдар", "Геласий", "Гелий", "Гельмут", "Геннадий", "Генри", "Генрих", "Георге", "Георгий", "Гераклид", "Герасим", "Герберт", "Герман", "Германн", "Геронтий", "Герхард", "Гийом", "Гильем", "Гинкмар", "Глеб", "Гней", "Гоар", "Горацио", "Гордей", "Градислав", "Григорий", "Густав", "Давид", "Дамир", "Даниил", "Дарий", "Демид", "Демьян", "Денис", "Дмитрий", "Доминик", "Дональд", "Донат", "Дорофей", "Досифей", "Евгений", "Евграф", "Евдоким", "Еврит", "Евсей", "Евстафий", "Евтихан", "Евтихий", "Егор", "Елеазар", "Елисей", "Емельян", "Епифаний", "Еремей", "Ермак", "Ермолай", "Ерофей", "Ефим", "Ефрем", "Захар", "Захария", "Збигнев", "Зденек", "Зейналабдин", "Зенон", "Зеэв", "Зигмунд", "Зинон", "Зия", "Золтан", "Иван", "Игнатий", "Игорь", "Икрима", "Иларий", "Илларион", "Илья", "Иннокентий", "Иоаким", "Иоанн", "Иоанникий", "Иоахим", "Иов", "Иоганн", "Иоганнес", "Ионафан", "Иосафат", "Ираклий", "Иринарх", "Ириней", "Иродион", "Исаак", "Исаакий", "Исаия", "Исидор", "Ислам", "Исмаил", "Истислав", "Истукарий", "Иштван", "Йюрген", "Кадваллон", "Кадир", "Казимир", "Каликст", "Калин", "Карен", "Карлос", "Карп", "Картерий", "Кассиан", "Кассий", "Касторий", "Киллиан", "Ким", "Кир", "Кириак", "Кирилл", "Клаас", "Клавдиан", "Клеоник", "Климент", "Кондрат", "Конон", "Конрад", "Константин", "Корнелиус", "Корнилий", "Коррадо", "Косьма", "Кратет", "Кратипп", "Крис", "Криспин", "Кристиан", "Кронид", "Кузьма", "Куприян", "Лаврентий", "Лавс", "Ладислав", "Лазарь", "Лайл", "Лампрехт", "Ландульф", "Лев", "Леви", "Ленни", "Леонид", "Леонтий", "Леонхард", "Лиам", "Линкей", "Логгин", "Лоренц", "Лоренцо", "Луи", "Луитпольд", "Лука", "Лукас", "Лукий", "Лукьян", "Луций", "Людовик", "Люцифер", "Макар", "Максим", "Максимиан", "Максимилиан", "Малик", "Малх", "Мануэль", "Мариан", "Мариус", "Марк", "Маркел", "Мартын", "Марчелло", "Матвей", "Матиас", "Матфей", "Мирон", "Мирослав", "Митрофан", "Михаил", "Михей", "Младан", "Модест", "Моисей", "Мордехай", "Мстислав", "Мурад", "Мухаммед", "Мэдисон", "Мэлор", "Нестор", "Никандр", "Никанор", "Никита", "Никифор", "Никодим", "Николай", "Нил", "Октав", "Октавиан", "Октавий", "Октавио", "Олаф", "Оле", "Олег", "Оливер", "Ольгерд", "Онисим", "Орест", "Осип", "Оскар", "Павел", "Павлин", "Павсикакий", "Паисий", "Палладий", "Панкратий", "Пантелеймон", "Парфений", "Патрик", "Пафнутий", "Пахомий", "Педро", "Пётр", "Пимен", "Пинхас", "Пипин", "Поликарп", "Поликрат", "Порфирий", "Потап", "Премысл", "Приск", "Прокопий", "Протасий", "Прохор", "Публий", "Рагнар", "Рагуил", "Радмир", "Радослав", "Разумник", "Раймонд", "Рамадан", "Рамазан", "Рахман", "Рашад", "Рейнхард", "Ренат", "Реститут", "Ричард", "Роберт", "Родерик", "Родион", "Рожер", "Розарио", "Роман", "Ромен", "Рон", "Ронан", "Ростислав", "Рудольф", "Руслан", "Руф", "Руфин", "Рушан", "Сабит", "Савва", "Савватий", "Савелий", "Савин", "Саддам", "Садик", "Саид", "Салават", "Салих", "Саллюстий", "Салман", "Самуил", "Сармат", "Святослав", "Севастьян", "Северин", "Секст", "Секунд", "Семён", "Септимий", "Серапион", "Сергей", "Серж", "Сигеберт", "Сильвестр", "Станислав", "Степан", "Стефано", "Стивен", "Таврион", "Тавус", "Тадеуш", "Тарас", "Тарасий", "Тейс", "Тендзин", "Теофил", "Терентий", "Терри", "Тиберий", "Тигран", "Тимофей", "Тимур", "Тихомир", "Тихон", "Томас", "Томоми", "Торос", "Тофик", "Трифон", "Трофим", "Тудхалия", "Тутмос", "Тьерри", "Тьяго", "Уве", "Уильям", "Улдис", "Ульрих", "Ульф", "Умар", "Урызмаг", "Усама", "Усман", "Фавст", "Фаддей", "Файзулла", "Фарид", "Фахраддин", "Федериго", "Федосей", "Федот", "Фейсал", "Феликс", "Феоктист", "Феофан", "Феофил", "Феофилакт", "Фердинанд", "Ференц", "Фёдор", "Фидель", "Филарет", "Филат", "Филип", "Филипп", "Фока", "Фома", "Фотий", "Франц", "Франческо", "Фредерик", "Фридрих", "Фродо", "Фрол", "Фульк", "Хайме", "Ханс", "Харальд", "Харитон", "Харри", "Харрисон", "Хасан", "Хетаг", "Хильдерик", "Хирам", "Хлодвиг", "Хокон", "Хорив", "Хоселито", "Хосрой", "Хрисанф", "Христофор", "Хуан", "Цэрэндорж", "Чеслав", "Шалом", "Шамиль", "Шамсуддин", "Шапур", "Шарль", "Шейх-Хайдар", "Шон", "Эберхард", "Эдмунд", "Эдна", "Эдуард", "Элджернон", "Элиас", "Эллиот", "Эмиль", "Энрик", "Энрико", "Энтони", "Эразм", "Эраст", "Эрик", "Эрнст", "Эсекьель", "Эстебан", "Этьен", "Ювеналий", "Юлиан", "Юлий", "Юлиус", "Юрий", "Януарий", "Яромир", "Ярополк", "Ярослав"};
    private final String[] femaleNamesRus = new String[]{"Августа", "Августина", "Авдотья", "Аврелия", "Аврея", "Аврора", "Агапа", "Агапия", "Агарь", "Агата", "Агафа", "Агафия", "Агафоклия", "Агафоника", "Агафья", "Агита", "Аглаида", "Аглая", "Агна", "Агнесса", "Агния", "Аграфена", "Агриппина", "Ада", "Аделаида", "Аделина", "Аделия", "Аделла", "Адель", "Адельфина", "Адиля", "Адина", "Адолия", "Адриана", "Аза", "Азалия", "Азелла", "Азиза", "Аида", "Айжан", "Айта", "Акгюль", "Акилина", "Аксиния", "Аксинья", "Акулина", "Алана", "Алевтина", "Александра", "Александрина"};
    private final String[] maleSurnamesRus = new String[]{"Абабков", "Абаимов", "Абакишин", "Абакулин", "Абакулов", "Абакумкин", "Абакумов", "Абакушин", "Абакшин", "Абалакин", "Абалаков", "Абалдуев", "Абалкин", "Абатурин", "Абатуров", "Абашев", "Абашеев", "Абашенко", "Абашин", "Абашичев", "Абашкин", "Абашков", "Абашуров", "Абаянцев", "Аббакумов", "Абдулин", "Абдулла", "Абдулов", "Аблакатов", "Аблеухов", "Абоимов", "Аборин", "Абраменко", "Абраменков", "Абрамкин", "Абрамов", "Абрамович", "Абрамсон", "Абрамуш", "Абрамцев", "Абрамчик", "Абрамчук", "Абрамычев"};
    private final String[] femaleSurnamesRus = new String[]{"Орлова", "Лебедева", "Симонова", "Александрова", "Третьякова", "Ленская", "Каменских", "Кожевникова", "Денисова", "Андреева", "Толмачева", "Шевченко", "Панченко", "Назарова", "Безрукова", "Соколова", "Родочинская", "Волкова", "Ковалевская", "Обломова", "Королева", "Волочкова", "Матвеева", "Левченко", "Лионова", "Котова", "Братиславская", "Полякова", "Ефимова", "Малышева", "Тарасова", "Новицкая", "Новикова", "Истомина", "Ивлева", "Ульянова", "Романова", "Гронская", "Бондаренко", "Хованская"};
    private final String[] femaleSecondNamesRus = new String[]{"Александровна", "Алексеевна", "Анатольевна", "Андреевна", "Антоновна", "Аркадьевна", "Артемовна", "Богдановна", "Борисовна", "Валентиновна", "Валерьевна", "Васильевна", "Викторовна", "Виталиевна", "Владимировна", "Владиславовна", "Вячеславовна", "Геннадиевна", "Георгиевна", "Григорьевна", "Даниловна", "Денисовна", "Дмитриевна", "Евгеньевна", "Егоровна", "Ефимовна", "Ивановна", "Игоревна", "Ильинична", "Иосифовна", "Кирилловна", "Константиновна", "Леонидовна", "Львовна", "Максимовна", "Матвеевна", "Михайловна", "Николаевна", "Олеговна", "Павловна", "Петровна", "Платоновна", "Робертовна", "Романовна", "Семеновна", "Сергеевна", "Станиславовна", "Степановна", "Тарасовна", "Тимофеевна", "Федоровна", "Феликсовна", "Филипповна", "Эдуардовна", "Юрьевна", "Яковлевна", "Ярославовна"};
    private final String[] maleSecondNamesRus = new String[]{"Александрович", "Алексеевич", "Анатольевич", "Андреевич", "Антонович", "Аркадьевич", "Артемович", "Бедросович", "Богданович", "Борисович", "Валентинович", "Валерьевич", "Васильевич", "Викторович", "Витальевич", "Владимирович", "Владиславович", "Вольфович", "Вячеславович", "Геннадиевич", "Георгиевич", "Григорьевич", "Данилович", "Денисович", "Дмитриевич", "Евгеньевич", "Егорович", "Ефимович", "Иванович", "Иваныч", "Игнатьевич", "Игоревич", "Ильич", "Иосифович", "Исаакович", "Кириллович", "Константинович", "Леонидович", "Львович", "Максимович", "Матвеевич", "Михайлович", "Николаевич", "Олегович", "Павлович", "Палыч", "Петрович", "Платонович", "Робертович", "Романович", "Саныч", "Северинович", "Семенович", "Сергеевич", "Станиславович", "Степанович", "Тарасович", "Тимофеевич", "Федорович", "Феликсович", "Филиппович", "Эдуардович", "Юрьевич", "Яковлевич", "Ярославович"};
    private Random r = new Random();

    protected String pickMaleFirstName() {

        int elem = r.nextInt(maleNamesRus.length);
        String n = maleNamesRus[elem];
        return n;
    }

    protected String pickFemaleFirstName() {
        int elem = r.nextInt(maleNamesRus.length);
        String n = femaleNamesRus[elem];
        return n;
    }

    protected String pickMaleSurname() {
        int elem = r.nextInt(maleSurnamesRus.length);
        String secondName = maleSurnamesRus[elem];
        return secondName;
    }

    protected String pickFemaleSurname() {
        int elem = r.nextInt(femaleSurnamesRus.length);
        String surname = femaleSurnamesRus[elem];
        return surname;
    }

    protected String pickFemaleSecname() {
        int elem = r.nextInt(femaleSecondNamesRus.length);
        String secondName = femaleSecondNamesRus[elem];
        return secondName;
    }

    protected String pickMaleSecname() {
        int elem = r.nextInt(maleSecondNamesRus.length);
        String secondName = maleSecondNamesRus[elem];
        return secondName;
    }


    protected int pickAge() {
        int age = r.nextInt(1, 110);
        return age;
    }


    public static String[] crutch() {
        String str = "Александрович\n" +
                "Алексеевич\n" +
                "Анатольевич\n" +
                "Андреевич\n" +
                "Антонович\n" +
                "Аркадьевич\n" +
                "Артемович\n" +
                "Бедросович\n" +
                "Богданович\n" +
                "Борисович\n" +
                "Валентинович\n" +
                "Валерьевич\n" +
                "Васильевич\n" +
                "Викторович\n" +
                "Витальевич\n" +
                "Владимирович\n" +
                "Владиславович\n" +
                "Вольфович\n" +
                "Вячеславович\n" +
                "Геннадиевич\n" +
                "Георгиевич\n" +
                "Григорьевич\n" +
                "Данилович\n" +
                "Денисович\n" +
                "Дмитриевич\n" +
                "Евгеньевич\n" +
                "Егорович\n" +
                "Ефимович\n" +
                "Иванович\n" +
                "Иваныч\n" +
                "Игнатьевич\n" +
                "Игоревич\n" +
                "Ильич\n" +
                "Иосифович\n" +
                "Исаакович\n" +
                "Кириллович\n" +
                "Константинович\n" +
                "Леонидович\n" +
                "Львович\n" +
                "Максимович\n" +
                "Матвеевич\n" +
                "Михайлович\n" +
                "Николаевич\n" +
                "Олегович\n" +
                "Павлович\n" +
                "Палыч\n" +
                "Петрович\n" +
                "Платонович\n" +
                "Робертович\n" +
                "Романович\n" +
                "Саныч\n" +
                "Северинович\n" +
                "Семенович\n" +
                "Сергеевич\n" +
                "Станиславович\n" +
                "Степанович\n" +
                "Тарасович\n" +
                "Тимофеевич\n" +
                "Федорович\n" +
                "Феликсович\n" +
                "Филиппович\n" +
                "Эдуардович\n" +
                "Юрьевич\n" +
                "Яковлевич\n" +
                "Ярославович\n";
        String[] arr = str.split("\n");
        return arr;
    }
}
